#pragma once
//-----------------------------------------------------------------------------------------------------------------------------------------------------------------
//                                  内排序 
// 特点：需要将待排序的记录放在计算机随机存储器中进行的排序过程
//
// 大致分为5种：插入排序、交换排序、选择排序、归并排序、计数排序
//  
//  说明：
//  此工程是以 数组排序为例  ，链表或其他结构大同小异   
//  每一个函数都在windows 下VS2015编译器运行过后 符合预期排序功能的   目前没有发在错误 或许存在一些忽视的错误
//  为了规范和统一接口函数调用方便使用   假定所有函数都没有返回 两个参数 1.数组 2.数组长度 
//  这些仅仅只是传统的排序思想，是对排序算法最简单验证，因此还可以随着学习，进行不断优化改进提高效率
//------------------------------------------------------------------------------------------------------------------------------------------------------------------//

//打印函数
void show(int *arr, int len);
//1直接 插入排序
void insert_sort(int *arr, int len);
//2 气泡法
void bubble_sort(int *arr, int len);
//3选择排序
void select_sort(int *arr, int len);
//4希尔排序
void shell_sort(int *arr, int len);
//5桶排序
void bucket_sort(int *arr, int len);
//6基数排序
void radix_sort(int *arr, int len);
//7归并排序
void merge_sort(int *arr, int len);
//8快速排序
void quick_sort(int *arr, int len);